university/app/Http/Controllers/Api/V1/TeacherController.php

select * from `teachers`
---
    public function index()
    {
        return Teacher::all();